{"config": {"output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, null], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"dtype": "float32", "batch_input_shape": [null, null], "sparse": false, "name": "input_2"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"input_length": null, "input_dim": 33295, "batch_input_shape": [null, null], "embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 100, "trainable": false, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "mask_zero": false, "name": "embedding_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1"}, {"config": {"input_length": null, "input_dim": 12828, "batch_input_shape": [null, null], "embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 100, "trainable": false, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "mask_zero": false, "name": "embedding_2"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_2"}, {"config": {"dtype": "float32", "batch_input_shape": [null, null], "sparse": false, "name": "input_3"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_3"}, {"config": {"bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "implementation": 1, "kernel_regularizer": null, "return_state": true, "kernel_constraint": null, "activity_regularizer": null, "unroll": false, "name": "lstm_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_1"}, {"config": {"bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 100, "implementation": 1, "kernel_regularizer": null, "return_state": true, "kernel_constraint": null, "activity_regularizer": null, "unroll": false, "name": "lstm_2"}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_2"}, {"config": {"input_length": null, "input_dim": 8539, "batch_input_shape": [null, null], "embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 100, "trainable": false, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "mask_zero": false, "name": "embedding_3"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_3"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "inbound_nodes": [[["lstm_1", 0, 1, {}], ["lstm_2", 0, 1, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "inbound_nodes": [[["lstm_1", 0, 2, {}], ["lstm_2", 0, 2, {}]]], "class_name": "Concatenate", "name": "concatenate_2"}, {"config": {"bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "return_sequences": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "use_bias": true, "dropout": 0.0, "go_backwards": false, "recurrent_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "implementation": 1, "kernel_regularizer": null, "return_state": false, "kernel_constraint": null, "activity_regularizer": null, "unroll": false, "name": "lstm_3"}, "inbound_nodes": [[["embedding_3", 0, 0, {}], ["concatenate_1", 0, 0, {}], ["concatenate_2", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_3"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "trainable": true, "units": 8539, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4"}