{"keras_version": "2.2.4", "class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "Context_input", "config": {"sparse": false, "batch_input_shape": [null, 675], "dtype": "int32", "name": "Context_input"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "Question_input", "config": {"sparse": false, "batch_input_shape": [null, 40], "dtype": "int32", "name": "Question_input"}}, {"inbound_nodes": [[["Context_input", 0, 0, {}]]], "class_name": "Embedding", "name": "context_embedding", "config": {"input_dim": 91926, "trainable": false, "batch_input_shape": [null, 675], "mask_zero": false, "input_length": 675, "output_dim": 100, "dtype": "float32", "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_constraint": null, "name": "context_embedding", "activity_regularizer": null}}, {"inbound_nodes": [[["Question_input", 0, 0, {}]]], "class_name": "Embedding", "name": "question_embedding", "config": {"input_dim": 91926, "trainable": false, "batch_input_shape": [null, 40], "mask_zero": false, "input_length": 40, "output_dim": 100, "dtype": "float32", "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_constraint": null, "name": "question_embedding", "activity_regularizer": null}}, {"inbound_nodes": [[["context_embedding", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_1", "config": {"return_state": false, "activation": "tanh", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "units": 200, "bias_constraint": null, "return_sequences": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "stateful": false, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unroll": false, "use_bias": true, "go_backwards": false, "implementation": 1, "name": "lstm_1"}}, {"inbound_nodes": [[["question_embedding", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_2", "config": {"return_state": false, "activation": "tanh", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unit_forget_bias": true, "units": 200, "bias_constraint": null, "return_sequences": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "stateful": false, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unroll": false, "use_bias": true, "go_backwards": false, "implementation": 1, "name": "lstm_2"}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "units": 43, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null}}], "name": "model_1", "input_layers": [["Context_input", 0, 0], ["Question_input", 0, 0]]}, "backend": "tensorflow"}