{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "input_2"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"activity_regularizer": null, "dtype": "float32", "input_dim": 33295, "embeddings_constraint": null, "name": "embedding_1", "batch_input_shape": [null, null], "mask_zero": false, "output_dim": 100, "trainable": false, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"activity_regularizer": null, "dtype": "float32", "input_dim": 12828, "embeddings_constraint": null, "name": "embedding_2", "batch_input_shape": [null, null], "mask_zero": false, "output_dim": 100, "trainable": false, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "input_3", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "input_3"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "stateful": false, "units": 100, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "return_state": true, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_constraint": null, "unit_forget_bias": true, "name": "lstm_1", "unroll": false, "bias_constraint": null, "dropout": 0.0}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "stateful": false, "units": 100, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "return_state": true, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_constraint": null, "unit_forget_bias": true, "name": "lstm_2", "unroll": false, "bias_constraint": null, "dropout": 0.0}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"activity_regularizer": null, "dtype": "float32", "input_dim": 8541, "embeddings_constraint": null, "name": "embedding_3", "batch_input_shape": [null, null], "mask_zero": false, "output_dim": 100, "trainable": true, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["lstm_1", 0, 1, {}], ["lstm_2", 0, 1, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": -1, "trainable": true}, "inbound_nodes": [[["lstm_1", 0, 2, {}], ["lstm_2", 0, 2, {}]]]}, {"name": "lstm_3", "class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "stateful": false, "units": 200, "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "return_state": true, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "bias_regularizer": null, "return_sequences": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_constraint": null, "unit_forget_bias": true, "name": "lstm_3", "unroll": false, "bias_constraint": null, "dropout": 0.0}, "inbound_nodes": [[["embedding_3", 0, 0, {}], ["concatenate_1", 0, 0, {}], ["concatenate_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8541, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "activation": "softmax"}, "inbound_nodes": [[["lstm_3", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}