{"backend": "tensorflow", "config": {"layers": [{"name": "answer", "config": {"batch_input_shape": [null, null], "sparse": false, "dtype": "float32", "name": "answer"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "answer_embeddings", "config": {"embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "output_dim": 100, "trainable": true, "dtype": "float32", "name": "answer_embeddings", "embeddings_regularizer": null, "batch_input_shape": [null, null], "embeddings_constraint": null, "mask_zero": false, "input_length": null, "activity_regularizer": null, "input_dim": 50676}, "class_name": "Embedding", "inbound_nodes": [[["answer", 0, 0, {}]]]}, {"name": "decoder_state_h_input", "config": {"batch_input_shape": [null, 200], "sparse": false, "dtype": "float32", "name": "decoder_state_h_input"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "decoder_state_c_input", "config": {"batch_input_shape": [null, 200], "sparse": false, "dtype": "float32", "name": "decoder_state_c_input"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "decoder_lstm", "config": {"trainable": true, "units": 200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "use_bias": true, "unit_forget_bias": true, "dropout": 0.0, "return_sequences": true, "bias_constraint": null, "return_state": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "recurrent_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "name": "decoder_lstm", "unroll": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "tanh", "recurrent_regularizer": null, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "LSTM", "inbound_nodes": [[["answer_embeddings", 0, 0, {}], ["decoder_state_h_input", 0, 0, {}], ["decoder_state_c_input", 0, 0, {}]]]}, {"name": "ouput", "config": {"bias_constraint": null, "trainable": true, "units": 50676, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "ouput", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "name": "model_24", "input_layers": [["answer", 0, 0], ["decoder_state_h_input", 0, 0], ["decoder_state_c_input", 0, 0]], "output_layers": [["ouput", 0, 0], ["decoder_lstm", 0, 1], ["decoder_lstm", 0, 2]]}, "class_name": "Model", "keras_version": "2.2.4"}