{"config": {"input_layers": [["answer", 0, 0], ["decoder_state_h_input", 0, 0], ["decoder_state_c_input", 0, 0]], "output_layers": [["ouput", 0, 0], ["decoder_lstm", 0, 1], ["decoder_lstm", 0, 2]], "name": "model_12", "layers": [{"config": {"sparse": false, "name": "answer", "batch_input_shape": [null, null], "dtype": "float32"}, "inbound_nodes": [], "name": "answer", "class_name": "InputLayer"}, {"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "output_dim": 100, "input_dim": 50677, "batch_input_shape": [null, null], "trainable": true, "embeddings_constraint": null, "input_length": null, "activity_regularizer": null, "mask_zero": false, "name": "answer_embeddings", "embeddings_regularizer": null, "dtype": "float32"}, "inbound_nodes": [[["answer", 0, 0, {}]]], "name": "answer_embeddings", "class_name": "Embedding"}, {"config": {"sparse": false, "name": "decoder_state_h_input", "batch_input_shape": [null, 200], "dtype": "float32"}, "inbound_nodes": [], "name": "decoder_state_h_input", "class_name": "InputLayer"}, {"config": {"sparse": false, "name": "decoder_state_c_input", "batch_input_shape": [null, 200], "dtype": "float32"}, "inbound_nodes": [], "name": "decoder_state_c_input", "class_name": "InputLayer"}, {"config": {"recurrent_dropout": 0.0, "implementation": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "return_sequences": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "use_bias": true, "units": 200, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "return_state": true, "bias_constraint": null, "activation": "tanh", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_regularizer": null, "name": "decoder_lstm"}, "inbound_nodes": [[["answer_embeddings", 0, 0, {}], ["decoder_state_h_input", 0, 0, {}], ["decoder_state_c_input", 0, 0, {}]]], "name": "decoder_lstm", "class_name": "LSTM"}, {"config": {"units": 50677, "kernel_regularizer": null, "name": "ouput", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}, "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "name": "ouput", "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}