{"config": {"input_layers": [["context", 0, 0], ["question", 0, 0]], "output_layers": [["concatenate_lstm_states_h", 0, 0], ["concatenate_lstm_states_c", 0, 0]], "name": "model_11", "layers": [{"config": {"sparse": false, "name": "context", "batch_input_shape": [null, null], "dtype": "float32"}, "inbound_nodes": [], "name": "context", "class_name": "InputLayer"}, {"config": {"sparse": false, "name": "question", "batch_input_shape": [null, null], "dtype": "float32"}, "inbound_nodes": [], "name": "question", "class_name": "InputLayer"}, {"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "output_dim": 100, "input_dim": 170521, "batch_input_shape": [null, null], "trainable": false, "embeddings_constraint": null, "input_length": null, "activity_regularizer": null, "mask_zero": false, "name": "context_embeddings", "embeddings_regularizer": null, "dtype": "float32"}, "inbound_nodes": [[["context", 0, 0, {}]]], "name": "context_embeddings", "class_name": "Embedding"}, {"config": {"embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "output_dim": 100, "input_dim": 69175, "batch_input_shape": [null, null], "trainable": false, "embeddings_constraint": null, "input_length": null, "activity_regularizer": null, "mask_zero": false, "name": "question_embeddings", "embeddings_regularizer": null, "dtype": "float32"}, "inbound_nodes": [[["question", 0, 0, {}]]], "name": "question_embeddings", "class_name": "Embedding"}, {"config": {"recurrent_dropout": 0.0, "implementation": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "return_sequences": false, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "use_bias": true, "units": 100, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "return_state": true, "bias_constraint": null, "activation": "tanh", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_regularizer": null, "name": "context_lstm"}, "inbound_nodes": [[["context_embeddings", 0, 0, {}]]], "name": "context_lstm", "class_name": "LSTM"}, {"config": {"recurrent_dropout": 0.0, "implementation": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "return_sequences": false, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "use_bias": true, "units": 100, "kernel_regularizer": null, "unroll": false, "unit_forget_bias": true, "return_state": true, "bias_constraint": null, "activation": "tanh", "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "bias_regularizer": null, "name": "question_lstm"}, "inbound_nodes": [[["question_embeddings", 0, 0, {}]]], "name": "question_lstm", "class_name": "LSTM"}, {"config": {"name": "concatenate_lstm_states_h", "trainable": true, "axis": -1}, "inbound_nodes": [[["context_lstm", 0, 1, {}], ["question_lstm", 0, 1, {}]]], "name": "concatenate_lstm_states_h", "class_name": "Concatenate"}, {"config": {"name": "concatenate_lstm_states_c", "trainable": true, "axis": -1}, "inbound_nodes": [[["context_lstm", 0, 2, {}], ["question_lstm", 0, 2, {}]]], "name": "concatenate_lstm_states_c", "class_name": "Concatenate"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Model"}